Merge pull request #7 from steveswinsburg/ssl
Add SSL
